Autodesk.Revit.DB.Structure.LoadCaseSet
A set that contains load cases.

Autodesk.Revit.DB.Structure.LoadCaseSet.Insert(Autodesk.Revit.DB.Structure.LoadCase)
System.Int32
Insert the specified load case into the set.
item: The load case to be inserted into the set.
Returns: Returns whether the load case was inserted into the set.

Autodesk.Revit.DB.Structure.LoadCaseSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.LoadCaseSet.ReverseIterator
Autodesk.Revit.DB.Structure.LoadCaseSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.LoadCaseSet.ForwardIterator
Autodesk.Revit.DB.Structure.LoadCaseSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.LoadCaseSet.Erase(Autodesk.Revit.DB.Structure.LoadCase)
System.Int32
Removes a specified load case from the set.
item: The load case to be erased.
Returns: The number of load cases that were erased from the set.

Autodesk.Revit.DB.Structure.LoadCaseSet.Contains(Autodesk.Revit.DB.Structure.LoadCase)
System.Boolean
Tests for the existence of a load case within the set.
item: The load case to be searched for.
Returns: The Contains method returns True if the load case is within the set, otherwise False.

Autodesk.Revit.DB.Structure.LoadCaseSet.Clear
void
Removes every load case from the set, rendering it empty.

Autodesk.Revit.DB.Structure.LoadCaseSet.Size
System.Int32
get
Returns the number of load cases that are in the set.

Autodesk.Revit.DB.Structure.LoadCaseSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.